/**
	*OLEDµÄIIC½Ó·¨£¨Ê¹ÓÃstm32f103RBT6µÄIIC1£©£º
	*VCC->3.3V
	*GND->GND
	*SCL->PB6
	*SDA->PB7
	*********************************************************************************************
	*ÅäÖÃOLEDÓÃOLED_Initº¯Êı£¨µ÷ÕûÁÁ¶ÈµÈµÈ£©£¬µ«ÊÇGRAMÀïÃæÒÀ¾É´æÔÚÖ®Ç°µÄÊı¾İ£¬ËùÒÔOLED_Clear¿ÉÒÔÇåÆÁ£¬
	*ÇåÆÁÖ®ºóOLED²»ÁÁ
	*********************************************************************************************
	*OLED_CHinese:ºº×ÖÊÇ16*16µÄÏñËØµã×é³É£¬ÏÈÏÔÊ¾ÍêµÚÒ»Ò³£¨¼´´Ó×óµ½ÓÒÏÔÊ¾Íê16¸ö×Ö½Ú£¨OLED8Î»ÌîÂúºó»á×ÔÔöµ½µÚ¶şÁĞ£©£©ÔÙÏÔÊ¾µÚ¶şÒ³
	*             Ç°Á½¸ö²ÎÊıÊÇ×ø±ê£¬ºóÒ»¸ö²ÎÊı¶ÔÓ¦µÚ¼¸ĞĞµÄºº×Ö¡£
	*OLED_ShowChar:×Ö·ûÓĞ8*16ºÍ6*8Á½ÖÖ¹æ¸ñ£¬ºÍºº×ÖÒ»Ñù¶¼ÊÇÏÈÏÔÊ¾µÚÒ»Ò³µÄ8ÁĞÔÙÌøµ½µÚ¶şÒ³£¬6*8¾Í²»ÓÃÌø
	*							 Ç°Á½¸öÊÇ×ø±ê£¬×ø±êÖĞµÄxÊÇ0-127£¬yÊÇ0-7,Èç¹ûÊÇ8*16µÄ×Ö·ûÔòÊÇ0-6.µÚÈı¸ö²ÎÊıÊÇĞèÒªÏÔÊ¾µÄ×Ö·ûµÄASIICÖµ¼ÓÉÏ32
	*							 µÄÒ»¸öÕûÊı³£Á¿£¬Ò²¿ÉÒÔÖ±½ÓÊäÈë×Ö·û£¬µ«±ØĞë¼ÓÉÏµ¥ÒıºÅ¡£µÚËÄ¸öÊÇ×ÖÌå¹æ¸ñ£¬ÓĞ16ºÍ6¿ÉÒÔÑ¡£¬¼´¶ÔÓ¦8*16ºÍ6*8
	*OLED_DrawBMP£ºÒ»Î¬Êı×éµÄĞÎÊ½£¬ÓĞÆğÊ¼µãºÍÖÕÖ¹µãÁ½¸ö×ø±ê²ÎÊı
	*±Ê¼Ç£º×Ö·ûĞÍ¾ÍÊÇÕûÊı
	*/

#include "delay.h"
#include "sys.h"
#include "oled.h"
#include "bmp.h"
#include "usart.h"


 int main(void)
  {	
		u8 t;
		delay_init();	    	 //ÑÓÊ±º¯Êı³õÊ¼»¯	  
		NVIC_Configuration(); 	 //ÉèÖÃNVICÖĞ¶Ï·Ö×é2:2Î»ÇÀÕ¼ÓÅÏÈ¼¶£¬2Î»ÏìÓ¦ÓÅÏÈ¼¶ 	LED_Init();			     //LED¶Ë¿Ú³õÊ¼»
		OLED_Init();			//³õÊ¼»¯OLED  
		OLED_Clear(); 
	while(1) 
	{		
		//OLED_Clear();
//		
//		OLED_ShowCHinese(108,0,6);//¼¼
//		OLED_ShowString(72,0,"@EAGLE",16);
//		OLED_ShowString(6,3,"0.96' OLED TEST",16);
//		OLED_ShowString(8,2,"ZHONGJINGYUAN",16);  
//	 	OLED_ShowString(20,4,"2014/05/01",16);  
//		OLED_ShowString(0,6,"ASCII:",16);  
//		OLED_ShowString(63,6,"CODE:",16);  
//				OLED_ShowChar(48,0,'C',16);//Ç°Á½¸öÊÇ×ø±ê¡£µÚÈı¸öÊÇÊäÈëµÄÊÇASIICÂë¼ÓÉÏ¿Õ¸ñµÄÒ»¸öÕûĞÍÊı£¬µÚËÄ¸öÊÇ×ÖÌå´óĞ¡£¬ÓĞ8*16ºÍ6*16µÄ¹æ¸ñ   
		OLED_DrawBMP(0,0,127,4,BMP1);
		OLED_ShowCHinese(0,6,0);  //ÎÒ
		OLED_ShowCHinese(20,6,1);//°®
		OLED_ShowCHinese(40,6,2);//Ñ§
		OLED_ShowCHinese(60,6,3);//Ï°
//		OLED_ShowCHinese(72,6,4);//×Ó
//		OLED_ShowCHinese(90,6,5);//¿Æ
//		OLED_ShowChar(48,6,48,16);//Ç°Á½¸öÊÇ×ø±ê¡£µÚÈı¸öÊÇÊäÈëµÄÊÇASIICÂë¼ÓÉÏ¿Õ¸ñµÄÒ»¸öÕûĞÍÊı£¬µÚËÄ¸öÊÇ×ÖÌå´óĞ¡£¬ÓĞ8*16ºÍ6*16µÄ¹æ¸ñ   
//		
//		if(t>'~')t=' ';
//		OLED_ShowNum(103,6,t,3,16);//ÏÔÊ¾ASCII×Ö·ûµÄÂëÖµ 	
//			delay_ms(8000);
		delay_ms(10000);
	}	  
}

